import type { FC } from "react";

import {
  Biology,
  ForeignLanguages,
  Geography,
  GeorgianLanguage,
  History,
  Math,
} from "../components/ui/Icons";
import { Gift, TrendingUp, WavyCheck } from "react-coolicons";

interface SubjectType {
  title: string;
  icon: string | FC<{ color?: string }>;
  id: number;
}

interface DiscoveryEducationItem {
  title: string;
  icon: string | FC<{ color?: string }>;
  backgroundColor: string;
}

interface WhyOurPlatform {
  title: string;
  description: string;
  color: string;
}

export const subjectsData: SubjectType[] = [
  { title: "ბიოლოგიის", icon: Biology, id: 1 },
  { title: "ქართული ენის", icon: GeorgianLanguage, id: 2 },
  { title: "ისტორიის", icon: History, id: 3 },
  { title: "მათემატიკის", icon: Math, id: 4 },
  { title: "უცხო ენის", icon: ForeignLanguages, id: 5 },
  { title: "გეოგრაფიის", icon: Geography, id: 6 },
];

export const discoveryEducationData: DiscoveryEducationItem[] = [
  {
    title: "საკუთარი ცოდნის გაძლიერება სერტიფიცირებული განათლებით",
    icon: WavyCheck,
    backgroundColor: "#63D49C",
  },
  {
    title: "ინდივიდუალურად მორგებული განათლება ხელმისაწვდომ ფასად",
    icon: Gift,
    backgroundColor: "rgba(125, 63, 255, 0.97)",
  },
  {
    title: "შეუზღუდავი მოქნილობა და მუდმივად მზარდი გამოცდილება",
    icon: TrendingUp,
    backgroundColor: "#FF8C38",
  },
];

export const whyOurPlatformData: WhyOurPlatform[] = [
  {
    title: "ონლაინ ვიდეო გაკვეთილები",
    description: `Evectus გთავაზობთ ონლაინ გაკვეთილებს, სადაც მოსწავლე იძენს ცოდნას პროფესიონალი მასწავლებლებისგან ცოცხალ რეჟიმში. ყოველი გაკვეთილი მოიცავს ინტერაქტიულ დავალებებს და უკუკავშირს, რათა სწავლა იყოს მარტივი და ეფექტური.`,
    color: "#8144FF",
  },
  {
    title: "დისტანციური რეგისტრაცია",
    description: `
    ჩვენი რეგისტრაციის სისტემა საშუალებას გაძლევთ მარტივად შექმნათ ანგარიში როგორც მოსწავლის, ისე მასწავლებლის სტატუსით. რეგისტრაციის დასრულების შემდეგ მიიღებთ წვდომას სასწავლო პანელზე, სადაც შეგიძლიათ აირჩიოთ სასურველი საგანი და დრო.`,
    color: "#0077FF",
  },
  {
    title: "სასწავლო გეგმები",
    description: `Evectus გთავაზობთ მოქნილ სასწავლო გეგმებს სხვადასხვა ასაკისა და
მიზნისთვის. შეგიძლიათ აირჩიოთ ინდივიდუალური ან ჯგუფური სწავლება,
ასევე მოკლევადიანი ან გრძელვადიანი კურსები თქვენი ინტერესებისა და
შესაძლებლობების მიხედვით.`,
    color: "#63D49C",
  },
  {
    title: "მოსწავლის პანელი",
    description: `მოსწავლის პანელი მოიცავს ყველა საჭირო ფუნქციას: გაკვეთილების
განრიგი, მასწავლებლებთან ჩათი, დავალებები და შეფასებები.
პლატფორმა ეხმარება მოსწავლეებს აკონტროლონ საკუთარი პროგრესი
და მიიღონ უკუკავშირი რეალურ დროში.`,
    color: "#FFD52A",
  },
  {
    title: "პროგრამული განვითარება",
    description: `ჩვენი საგანმანათლებლო პროგრამების განახლება რეგულარულად ხდება, თანამედროვე საგანმანათლებლო სტანდარტების შესაბამისად. თითოეული კურსი შექმნილია ისე, რომ დაეხმაროს მოსწავლეებს ცოდნის განმტკიცებასა და პრაქტიკულ განვითარებაში.
`,
    color: "#FF5638",
  },
  {
    title: "კომუნიკაცია",
    description: `Evectus აერთიანებს მასწავლებლებსა და მოსწავლეებს კომუნიკაციის
თანამედროვე ფორმებით — ჩათი, ვიდეოკონფერენცია და შეტყობინებების
სისტემა. ჩვენი მიზანია, რომ სწავლის პროცესი იყოს კომფორტული,
მეგობრული და აქტიური.`,
    color: "#FF8C38",
  },
  {
    title: "შეფასების სისტემა",
    description: `მოსწავლეებს შეუძლიათ მიიღონ შეფასება ყოველი გაკვეთილის შემდეგ,
რაც დაეხმარებათ პროგრესის კონტროლსა და განვითარებაში.`,
    color: "#64d",
  },
  {
    title: "მასწავლებლის პროფილი",
    description: `მასწავლებლის პროფილში წარმოდგენილია გამოცდილება, განათლება,
შეფასებები და ხელმისაწვდომი საათები — რაც ამარტივებს სწორი
არჩევანის გაკეთებას`,
    color: "#69d",
  },
];

export const tutorSwiper = [
  {
    img: "/images/giorgi.png",
    subject: "არაბული ენის რეპეტიტორი",
    fullName: "გიორგი კაციაშვილი",
    description:
      "შედეგად, ტექსტი ჩვეულებრივ ინგლისურს გავს, მისი წაითხვა კი შეუძლებელია. დღეს უამრავი პერსონალური საგამომცემლო",
    price: 35.0,
    star: 4.8,
  },
  {
    img: "/images/giorgi.png",
    subject: "არაბული ენის რეპეტიტორი",
    fullName: "გიორგი კაციაშვილი",
    description:
      "შედეგად, ტექსტი ჩვეულებრივ ინგლისურს გავს, მისი წაითხვა კი შეუძლებელია. დღეს უამრავი პერსონალური საგამომცემლო",
    price: 35.0,
    star: 4.8,
  },
  {
    img: "/images/giorgi.png",
    subject: "არაბული ენის რეპეტიტორი",
    fullName: "გიორგი კაციაშვილი",
    description:
      "შედეგად, ტექსტი ჩვეულებრივ ინგლისურს გავს, მისი წაითხვა კი შეუძლებელია. დღეს უამრავი პერსონალური საგამომცემლო",
    price: 35.0,
    star: 4.8,
  },
  {
    img: "/images/giorgi.png",
    subject: "არაბული ენის რეპეტიტორი",
    fullName: "გიორგი კაციაშვილი",
    description:
      "შედეგად, ტექსტი ჩვეულებრივ ინგლისურს გავს, მისი წაითხვა კი შეუძლებელია. დღეს უამრავი პერსონალური საგამომცემლო",
    price: 35.0,
    star: 4.8,
  },
  {
    img: "/images/giorgi.png",
    subject: "არაბული ენის რეპეტიტორი",
    fullName: "გიორგი კაციაშვილი",
    description:
      "შედეგად, ტექსტი ჩვეულებრივ ინგლისურს გავს, მისი წაითხვა კი შეუძლებელია. დღეს უამრავი პერსონალური საგამომცემლო",
    price: 35.0,
    star: 4.8,
  },
];
